{
  "client_name": "EsVital",
  "client_logo": "@/assets/esvital.webp",
  "client_description": "EsVital es un centro especializado en salud, estética y bienestar, enfocado en dermatología clínica, tratamientos estéticos y procedimientos láser. Con una visión orientada al futuro, la empresa reconoce que la **inteligencia artificial** será clave para optimizar procesos, mejorar la experiencia de los pacientes y elevar los estándares del sector. Esta mentalidad de evolución constante impulsa a EsVital a integrar soluciones digitales que fortalezcan su **liderazgo en el mercado**.",

  "objective": {
    "description": "Implementar Fail Fast como el núcleo de un **CRM inteligente** orientado a la **atención clínica**, que nos permite:",
    "key_capabilities": [
      "**Gestión de historia clínica**\n  - **Catálogo de tratamientos y productos**, incluyendo duración y recursos requeridos. \nConsulta y reserva **disponibilidad de médicos y equipos** en tiempo real. \n **Registro gráfico** de la evolución del Paciente",
      "**Gestión de clientes en el CRM** \n -Análisis de Origen del Cliente \n -Dashboard del comportamiento de Clientes",
      "**Agente de IA que vende** \n  -Consulta disponibilidad (médicos y equipos) y **agenda citas automáticamente**, considerando turnos, tiempos de tratamientos y recursos necesarios. \n -Agenda citas y enviar recordatorios sincronizados con **Google Calendar**"
    ],
    "platforms": [
      {
        "name": "WhatsApp",
        "icon": "MessageCircle",
        "color": "green"
      },
      {
        "name": "Google Calendar",
        "icon": "Calendar",
        "color": "yellow"
      }
    ]
  },

  "project_phases": [
    {
      "step": "01",
      "title": "Preparación y definición de proceso",
      "intro": "Realizaremos sesiones de trabajo con el equipo de EsVital para acordar las reglas de negocio del CRM, historia clínica y del agente:",
      "description": [
        "4 horas de levantamiento de información",
        "Validar el proceso de CRM e historia clínica",
        "Definir datos maestros (pacientes, profesionales, recursos e inventarios).",
        "Definir indicadores que se visualizarán en el dashboard",
        "Definición de estructura de migracion de movimientos contables",
        "Definir las necesidades de interoperabilidad con WhatsApp y Google Calendar"
      ],
      "timeline": "1 semana",
      "endDate": "3–7 de noviembre",
      "icon": "Users",
      "colorTheme": "blue"
    },
    {
      "step": "02",
      "title": "Contextualización en IA y Meta",
      "intro": "Brindaremos al equipo una visión práctica sobre el uso de Inteligencia Artificial y agentes aplicados al proceso comercial:",
      "description": [
        "4 horas de capacitación y asesoria",
        "Introducción a conceptos clave de IA y agentes conversacionales",
        "Enfoque en la automatización de procesos comerciales",
        "Uso estratégico de herramientas Meta (WhatsApp)"
      ],
      "timeline": "1 semana",
      "endDate": "3–7 de noviembre",
      "icon": "brain-circuit",
      "colorTheme": "orange"
    },
    {
      "step": "03",
      "title": "Parametrización de reglas de negocio",
      "intro": "Con los acuerdos previos, parametrizamos las reglas de negocio del CRM. Esta actividad la haremos en conjunto con el equipo de EsVital.",
      "description": [
        "Parametrización del CRM e historia clínica",
        "Modelado de historias clínicas e inventarios",
        "Desarrollo del agente de AI",
        "Reglas de agenda por profesional y recurso",
        "Prototipo navegable del CRM (embudo, ficha de paciente, mapa de tratamientos)",
        "Permisos de acceso",
        "Construccion de un tablero con las métricas definidas"
      ],
      "timeline": "3 semanas",
      "endDate": "10 - 28 de noviembre",
      "icon": "Database",
      "colorTheme": "purple"
    },
    {
      "step": "04",
      "title": "Capacitaciones Fail Fast - CRM",
      "intro": "Realizaremos sesiones de entrenamiento con el equipo de EsVital para garantizar una adopción efectiva del sistema y del agente de ventas:",
      "description": [
        "20 horas",
        "Capacitaciones prácticas con los usuarios",
        "Carga de datos maestros, parametrización de líneas de negocio (productos, paquetes, tratamientos)",
        "Pruebas end-to-end de RIPS y facturación electrónica con casos reales; validación de auditoría y trazabilidad.",
        "Test: Operación con usuarios, conflictos de agenda.",
        "Test: Historia clínica"
      ],
      "timeline": "2 semanas",
      "endDate": "1 - 12 de diciembre",
      "icon": "GraduationCap",
      "colorTheme": "teal"
    },
    {
      "step": "05",
      "title": "Go Live",
      "intro": "Salida en producción del sistema CRM e historia clínica.",
      "description": [
        "Agente en producción",
        "Monitoreo de KPIs (tiempos de atención, no-show, exactitud de agenda)",
        "Monitoreo de Facturacion y envío de RIPS",
        "Ajustes requeridos"
      ],
      "timeline": "2 semanas",
      "endDate": "5-9 de enero",
      "icon": "Rocket",
      "colorTheme": "orange"
    }
  ],

  "pricing_tiers": [
    {
      "icon": "FileCheck2",
      "title": "Facturación Electrónica",
      "price": "220 COP",
      "period": "220 pesos por transacción",
      "features": ["Facturación electrónica", "RIPS"],
      "buttonText": "Comenzar",
      "highlighted": false
    },
    {
      "icon": "Bot",
      "title": "Ejecuciones del Agente",
      "price": "$4.99",
      "period": "USD por 2,500 ejecuciones",
      "features": ["Precio ajustado al costo de ejecución"],
      "buttonText": "Comenzar",
      "highlighted": false
    },
    {
      "icon": "UserRound",
      "title": "Usuario",
      "price": "$29",
      "period": "USD por mes",
      "features": [
        "CRM - Gestión centralizada de clientes y agenda, registro y seguimiento de oportunidades de venta",
        "Historia clínica - registro, catalogo de tratamientos, registro gráfico",
        "Facturación electrónica, RIPS",
        "Contabilidad, Inventarios",
        "Panel de control con KPIs de ventas",
        "Notificaciones inteligentes y tareas automáticas"
      ],
      "buttonText": "Comenzar",
      "highlighted": false
    },
    {
      "icon": "Rocket",
      "title": "Proyecto & Consultoría",
      "price": "$19,999",
      "period": "USD pago único",
      "features": [
        "Desarrollo de un agente de ventas adaptado al contexto de EsVital.",
        "Implementación de CRM para la gestión de clientes y oportunidades de venta.",
        "Levantamiento del proceso y parametrización del sistema",
        "Capacitación y contextualización sobre AI y Meta.",
        "Capacitación a usuarios finales sobre el uso de Fail Fast - AI CRM & ERP"
      ],
      "buttonText": "Contactar",
      "highlighted": true
    }
  ],

  "commercial_terms": [
    {
      "icon": "DollarSign",
      "text": "Forma de pago: 20% al inicio del proyecto, 20% al terminar la fase de desarrollo de lógica de negocio, 30% al terminar la fase de Capacitaciones de Fail Fast, 30% contra entrega del proyecto. Suscripciones de usuarios facturadas mensualmente de manera anticipada."
    },
    {
      "icon": "FileText",
      "text": "Facturación: emisión en USD. Impuestos locales (IVA/retenciones) no incluidos; se aplican según normativa vigente."
    },
    {
      "icon": "Briefcase",
      "text": "Alcance: el precio de proyecto cubre únicamente la implementación del CRM y ERP así como el agente de ventas por WhatsApp. Integraciones adicionales, migraciones y desarrollos a medida se cotizan por separado."
    },
    {
      "icon": "Clock",
      "text": "Vigencia de la oferta: 15 días calendario a partir de la fecha de envío."
    },
    {
      "icon": "Zap",
      "text": "SLA y soporte: soporte estándar en horario hábil (L–V 8:00–17:00, GMT-5). Tiempo de primera respuesta: 2 horas hábiles."
    },
    {
      "icon": "Users",
      "text": "Capacitaciones: incluye onboarding inicial para la organización. Entrenamientos a la medida o sesiones adicionales se cotizan aparte."
    },
    {
      "icon": "Shield",
      "text": "Propiedad y datos: la información del cliente es de su exclusiva propiedad. Los derechos de Fail Fast y desarrollos seguirán siendo propiedad de Fail Fast."
    },
    {
      "icon": "Shield",
      "text": "Confidencialidad: ambas partes se comprometen a la reserva de la información técnica y comercial compartida."
    },
    {
      "icon": "FileText",
      "text": "Cambios y horas adicionales: solicitudes fuera de alcance se gestionan vía cambio controlado y se facturan según tarifa vigente."
    },
    {
      "icon": "FileText",
      "text": "Cancelación: en caso de cancelación anticipada del proyecto, se facturará el trabajo ejecutado y compromisos adquiridos."
    }
  ]
}
