{
  "client_name": "Hotel Casablanca",
  "client_logo": "@/assets/hotel_casablanca.png",
  "client_description": "El Hotel Casablanca Cúcuta es un establecimiento hotelero icónico con más de seis décadas de historia y servicio ininterrumpido en la región.\n\nSe ha consolidado como un referente del sector turístico y comercial de la ciudad gracias a su ubicación estratégica en el corazón comercial y financiero, ofreciendo fácil acceso a puntos clave como la Gobernación de Norte de Santander, centros comerciales y principales atractivos turísticos, lo cual es ideal tanto para huéspedes de negocios como de placer.\n\nEl hotel dispone de una infraestructura versátil que incluye 120 habitaciones modernas y confortables, además de 13 salones para eventos con capacidad para adaptarse a diversas necesidades corporativas y sociales. Sus servicios integrales abarcan dos restaurantes (Cabá y Bar 360), piscina, gimnasio, servicios de spa y conexión WiFi gratuita.",
  "objective": {
    "description": "Desarrollar un asistente de de IA para las ventas de las tres líneas de negocio (Hotel, Restaurante y Eventos) a traves de:",
    "platforms": [
      {
        "name": "WhatsApp",
        "icon": "MessageCircle",
        "color": "green"
      },
      {
        "name": "Instagram",
        "icon": "MessageCircle",
        "color": "yellow"
      },
      {
        "name": "Facebook",
        "icon": "MessageCircle",
        "color": "blue"
      }
    ],
    "key_capabilities": [
      "Recomienda productos y es capaz de generar una reserva",
      "Consulta disponibilidad de habitaciones y salones",
      "Realiza reservaciones de habitaciones y salones",
      "Registra historial de interacciones y las clasifica",
      "Permite hacer seguimiento de leads y clientes",
      "Es capaz de realizar **cierres de ventas** para (Hotel y Restaurante)",
      "Genera un Dashboard para la toma de **decisiones estratégicas**"
    ]
  },
  "project_phases": [
    {
      "step": "01",
      "title": "Preparación y levantamiento de información",
      "intro": "Realizaremos sesiones de trabajo con el equipo de Casa Blanca para acordar las reglas de negocio del agente:",
      "description": [
        "10 horas de levantamiento de información",
        "Definir casos de uso prioritarios",
        "Definir el proceso comercial - pipe line",
        "Determinar momentos en los que debe intervenir un asesor",
        "Acordar los canales de atención (WhatsApp, Facebook e Instagram)"
      ],
      "timeline": "1 semana",
      "endDate": "",
      "icon": "Users",
      "colorTheme": "blue"
    },
    {
      "step": "02",
      "title": "Contextualización en IA y Meta",
      "intro": "Brindaremos al equipo una visión práctica sobre el uso de Inteligencia Artificial y agentes aplicados al proceso comercial:",
      "description": [
        "5 horas de capacitación",
        "Introducción a conceptos clave de IA y agentes conversacionales",
        "Enfoque en la automatización de procesos comerciales",
        "Uso estratégico de herramientas Meta (WhatsApp)",
        "Buenas prácticas para la interacción entre agente y asesor humano"
      ],
      "timeline": "1 semana",
      "endDate": "",
      "icon": "Rocket",
      "colorTheme": "orange"
    },
    {
      "step": "03",
      "title": "Desarrollo de Agente de IA",
      "intro": "Customización del Agente de acuerdo con las caracteristicas definidas durante el levantamiento de información",
      "description": [
        "Se aplican modificaciones al agente para que cumpla con las reglas de negocio establecidas",
        "Despliegue del Agente en ambiente productivo en los Canales de Atención seleccionados"
      ],
      "timeline": "2 semanas",
      "endDate": "",
      "icon": "Rocket",
      "colorTheme": "green"
    },
    {
      "step": "04",
      "title": "Lanzamiento e iteracion - Agente de ventas (memoria y contexto)",
      "intro": "Pondremos en marcha el agente, iterando el contexto con el objetivo de optimizar su desempeño ",
      "description": [
        "Será capaz de recordar conversaciones por cliente",
        "Recuperar el contexto en cada contacto y ofrecer recomendaciones alineadas con el portafolio.",
        "Implementaremos las reglas acordadas para alertas y traspaso a asesores en momentos clave."
      ],
      "timeline": "2 semanas",
      "endDate": "",
      "icon": "Rocket",
      "colorTheme": "orange"
    }
  ],
  "pricing_tiers": [
    {
      "icon": "Rocket",
      "title": "Agente de Ventas",
      "price": "$1167",
      "period": "USD mes",
      "features": [
        "Desarrollo de un agente orquestador de ventas adaptado al contexto de hotel casa blanca. ",
        "  • Agente para restaurante ",
        "  • Agente para reserva de hotel ",
        "  • Agente para eventos ",
        "  • Interacción con humano en momentos clave",
        "Tres usuarios en la plataforma Fail Fast - CRM & Agentes",
        "Automatización de interacciones comerciales",
        "Levantamiento del proceso de automatización del agente",
        "Capacitación y contextualizacion sobre AI y Meta.",
        "Acompañamiento de un mes despues del lanzamiento del agente de ventas optimizando su desempeño",
        "Panel de control con KPIs de ventas",
        "Notificaciones inteligentes y tareas automáticas",
        "2500 ejecuciones del agente",
        "Solucion 100% en la nube - disponibilidad 7X24X365",
        "Soporte 5X8"
      ],
      "buttonText": "Contactar",
      "highlighted": true
    },
    {
      "icon": "Rocket",
      "title": "Activa una fuerza laboral sin límites con ",
      "price": "Agentes de IA",
      "period": "",
      "features": [
        "🚀 Rompe las barreras del tiempo — los agentes trabajan 24/7, sin pausas ni restricciones.",
        "🤝 Amplía tu equipo sin contratar más — los agentes de IA se integran a tu fuerza laboral humana.",
        "⚡  Optimiza la productividad — los agentes ejecutan tareas operativas para liberar tiempo valioso.",
        "🎯 Enfoca a tu equipo en lo que importa — las personas se concentran en tareas estratégicas y de alto impacto."
      ],
      "buttonText": "Contactar",
      "highlighted": true
    }
  ],
  "commercial_terms": [
    {
      "icon": "DollarSign",
      "text": "Forma de pago: el valor mensual se factura por anticipado, contando con 5 días habiles para su pago."
    },
    {
      "icon": "FileText",
      "text": "Facturación: emisión en USD desde EE.UU. (Fail Fast Inc.) o en COP a través de Quality Software SAS (Colombia), según el acuerdo comercial. El servicio en la nube está exento de IVA conforme al artículo 476 del Estatuto Tributario."
    },
    {
      "icon": "Briefcase",
      "text": "Alcance: el precio del proyecto cubre el desarrollo e implementación del agente de ventas para WhatsApp, Facebook e Instagram. Integraciones adicionales, migraciones o desarrollos a medida se cotizan por separado."
    },
    {
      "icon": "Clock",
      "text": "Vigencia de la oferta: 15 días calendario a partir de la fecha de envío."
    },
    {
      "icon": "Zap",
      "text": "SLA y soporte: soporte estándar en horario hábil (L–V 8:00–17:00, GMT-5). Tiempo de primera respuesta: 2 horas hábiles."
    },
    {
      "icon": "Users",
      "text": "Capacitaciones: incluye onboarding inicial para los usuarios. Entrenamientos personalizados o sesiones adicionales se cotizan aparte."
    },
    {
      "icon": "Shield",
      "text": "Propiedad y datos: la información del cliente es de su exclusiva propiedad. Los derechos sobre la plataforma y desarrollos continúan siendo propiedad de Fail Fast."
    },
    {
      "icon": "Shield",
      "text": "Confidencialidad: ambas partes se comprometen a la reserva de la información técnica y comercial compartida."
    },
    {
      "icon": "FileText",
      "text": "Tiempo mínimo de contratación: 12 meses. En caso de cancelación anticipada, se facturará el servicio restante. Posterior al primer año, el cliente podrá cancelar el servicio en cualquier momento sin penalidad."
    },
    {
      "icon": "FileText",
      "text": "Valores adicionales: - Usuario adicional: $29 USD por mes. - Ejecuciones adicionales: $4.99 USD por 2,500 ejecuciones.  La adquisicion de tockens se realizara directamente por parte del cliente"
    }
  ]
}
